words = {
    0: '',
    1: 'один',
    2: 'два',
    3: 'три',
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять",

    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: "тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать",

    20: "двадцать",
    30: "тридцать",
    40: "сорок",
    50: "пятьдесят",
    60: "шестьдесят",
    70: "семьдесят",
    80: "восемьдесят",
    90: "девяносто"
}


def number_to_words(num):
    if num in range(0, 19):
        return words[num]
    upper, lower = (num - num % 10) if num > 10 else 0, num % 10
    return f'{words[upper]} {words[lower]}'


print(number_to_words(20))
